/*
Задание:
Напишите программу, выводящую "Hello, World!".
*/

#include <iostream>

using namespace std;

int main() {
    // put your code here
    cout << "Hello, World!";
    return 0;
}